'''
Дополнительные задания

Задание 2
Напиши функцию, которая рассчитывает цифровой корень числа. 
Чтобы получить числовой корень числа, нужно:
Первоначальное число разбить на цифры по разрядам.
Сложить эти цифры.
С суммой сделать то же самое: разбить на цифры и сложить их.
И так — пока не получится одна цифра (от 1 до 9), которая и будет цифровым корнем числа.
Например, числовой корень числа 4851 — 9.
4851 → 4+8+5+1 = 18
18 → 1+8 = 9
Цифровой корень 97569 равен 9:
97569 → 9+7+5+6+9 = 36
36 → 3+6 = 9
Пример посложнее. Для числа 889987 цифровой корень — 4:
889987 → 8+8+9+9+8+7= 49
49 → 4+9 = 13
13 → 4
Функцию можно назвать digit_root(num). Она принимает на вход один параметр — num (число), а возвращает цифровой корень.
Условия: 
входное число натуральное (1, 2, 3, … );
число не превышает 10 
7
'''

def digit_root(num:int) -> int:
    '''Функция расчитывает цифровой корень числа'''
    if not isinstance(num, int) or num > 10**7: #обрабатываем условия
        return #Возвращаем None
    
    while num > 9:
        num = sum([int(digit_char) for digit_char in str(num)]) #создаем list comprehension
        
        
    return num #Возвращаем наше получившееся число


def main():
    '''Функция main'''
    print(digit_root(4851))
    print(digit_root(97569))
    print(digit_root(889987))

if __name__ == '__main__':
    main()